# calculator-moiseev-dm
Что сделано в программе:
Программа представляет собой простой интерпретатор арифметических выражений, который может вычислять выражения, содержащие числа, скобки, а также операции сложения (+), вычитания (-), умножения (*) и деления (/). Программа работает с выражениями, введенными пользователем с клавиатуры.

Как это запустили:
Программа компилируется с помощью компилятора C (например, gcc):

bash
Copy
gcc -o calculator calculator.c
После компиляции программа запускается из командной строки:

bash
Copy
./calculator
После запуска программа ожидает ввода арифметического выражения (например, 2 + 3 * (4 - 1)). Пользователь вводит выражение и нажимает Enter.

Программа вычисляет результат и выводит его на экран.

Как это сделано:
Структура программы:

Программа состоит из нескольких функций, каждая из которых отвечает за обработку определенной части выражения:

evaluate_expression() — обрабатывает сложение и вычитание.

evaluate_term() — обрабатывает умножение и деление.

evaluate_factor() — обрабатывает числа и подвыражения в скобках.

read_number() — считывает число из строки.

skip_spaces() — пропускает пробелы в строке.

Основные шаги:

В функции main() программа считывает ввод пользователя с помощью fgets() и сохраняет его в буфер input_buffer.

Указатель expression указывает на введенную строку.

Программа начинает вычисление выражения с вызова функции evaluate_expression().

В процессе вычисления программа рекурсивно вызывает функции evaluate_term() и evaluate_factor() для обработки операций и подвыражений.

Результат вычисления выводится на экран с помощью printf().

Обработка выражений:

Программа учитывает приоритет операций: умножение и деление выполняются перед сложением и вычитанием.

Подвыражения в скобках обрабатываются рекурсивно.

Пробелы в выражении игнорируются.

Пример работы:

Ввод: 2 + 3 * (4 - 1)

Вывод: 11

Объяснение: Сначала вычисляется выражение в скобках (4 - 1) = 3, затем выполняется умножение 3 * 3 = 9, и в конце сложение 2 + 9 = 11.

Особенности программы:
Программа не обрабатывает ошибки ввода (например, некорректные символы или неправильную расстановку скобок).

Поддерживаются только целочисленные операции.

Программа работает с выражениями, длина которых не превышает 1023 символа (ограничение буфера ввода).

Возможные улучшения:
Добавить обработку ошибок (например, некорректные символы, деление на ноль).

Расширить функциональность для поддержки вещественных чисел.

Добавить поддержку более сложных операций (например, возведение в степень).

Увеличить размер буфера ввода или использовать динамическое выделение памяти.
